<template>
	<view class="content">
		<!-- <image class="logo" src="/static/logo.png"></image> -->
		<!-- <view>
			<text>NBA资讯</text>
		</view> -->

		<swiper 
			:indicator-dots="indicatorDots"
			:autoplay="autoplay" 
			:interval="interval" 
			:duration="duration">
			<block v-for="(item, index) in background" :key="index">
			<swiper-item>
				<view class="swiper-item" :class="item">
					<image :src="item.url" mode="widthFix" />
				</view>
			</swiper-item>
			</block>
		</swiper>

		<!-- button -->
		<view class="btn_view">
			<button @click="toList" type="warn">河北爱国主义教育基地</button>
		</view>

		<view class="info">
			<view>历史是最好的教科书。爱国主义教育基地是党和国家的红色基因库，是弘扬民族精神、传承红色基因的重要地标和生动课堂，是开展党史学习教育和“四史”宣传教育的重要载体和有效抓手。</view>
			<view>日前，省委宣传部新命名石家庄市博物馆等18个单位为第六批河北省爱国主义教育基地。至此，河北省共有全国爱国主义教育示范基地23家，省级爱国主义教育基地118家，市级爱国主义教育基地206家，县级爱国主义教育基地204家。全省范围内初步形成以全国示范基地为龙头、省级基地为骨干，各级各类教育基地相辅相成、共同发展、结成网络的良好局面。</view>
			<view>提高政治站位，建好管好用好爱国主义教育基地</view>
			<view>革命历史和红色资源永远值得珍视，革命传统和革命精神永远值得崇敬。</view>
			<view>河北省在全国率先制定了爱国主义教育基地设施建设规范。近年来，各级爱国主义教育基地不断提高基础设施水平，注重教育基地硬件设施、景观环境建设，以优美肃穆的景观环境吸引参观者、打动参观者，为参观者提供了更为丰富的教育内容。</view>
			<view>加强市场推广，提升河北红色旅游影响力。与京津两市在北京共同举办追寻红色印记京津冀红色旅游联合推广活动，全省红色经典景区和经营红色旅游业务的旅行社积极参与活动，广泛宣传“红色河北·寻根逐梦”红色旅游品牌。西柏坡利用红色圣地的品牌影响力，依托周边丰富的红色旅游资源，倡导成立由13个省市、146家红色旅游景区为骨干的西柏坡红色旅游联盟，加大红色革命圣地景区间的区域交流与合作。</view>
		</view>
		
		<!-- <view class="list">
			<view class="one" v-for="(item, index) in list" :key="item.id">
				<view class="img">
					<image :src="item.url" mode="widthFix" style="width: 150px; height: 120px;" />
				</view>
				<view class="content">
					<text>{{item.title}}</text>
					<text>2022-02-09</text>
				</view>
			</view>
		</view> -->
	</view>
</template>

<script lang="ts">
	export default {
		data() {
			return {
				background: [
					{
						url: '/static/swiper1.jpeg',
					},
					{
						url: '/static/swiper2.jpg',
					},
					{
						url: '/static/swiper3.jpg',
					},
				],
				indicatorDots: true,
				vertical: false,
				autoplay: true,
				interval: 3000,
				duration: 500,
				list: [
					{
						id: 1,
						url: '/static/pic1.jpeg',
						title: '詹姆斯27分湖人遭雄鹿双杀 字母哥轰44＋14',
						msg: `
							<p>北京时间2月9日，雄鹿客场131-116击败湖人，拿下4连胜，而且本赛季双杀对手。詹姆斯得到27分8助攻，连续20场比赛得分25+。湖人最多落后30分，末节虽然一度将分差缩小到10分，但还是败下阵来。字母哥轰下44分14篮板8助攻，投篮20投17中。</p>
							<p>比赛回顾</p>
							<p>米德尔顿上篮得分，詹姆斯连中两记三分，字母哥接连封盖威少和浓眉，还连拿6分。阿里扎、蒙克三分命中，字母哥又连得5分，康诺顿抢断扣篮，雄鹿打出一波16-3，将分差拉开到11分。浓眉打成2+1，康诺顿三分命中，浓眉补篮命中，字母哥中投命中。米德尔顿连进两球，詹姆斯上篮得分，首节战罢，雄鹿38-24领先湖人，字母哥13分，米德尔顿11分，詹姆斯9分。</p>
						`
					},
					{
						id: 2,
						url: '/static/pic2.png',
						title: '布克轰35分太阳胜费城 恩比德空砍34＋12',
						msg: `
							<p>北京时间2月9日，NBA常规赛继续进行，太阳客场挑战费城。此役上半场打得非常激烈，第三节伊始费城轰出一波10-0拉开了14分差距。但太阳随即开始疯狂反扑，三节结束就将分差几乎抹平。决胜时刻，落后3分的费城出现致命失误。最终太阳以114-109险胜费城，取得了3连胜。</p>
							<p>比赛回顾</p>
							<p>保罗上篮先拔头筹，布克送上三分，哈里斯空切命中，布里奇斯内线打成，布克送上三分，恩比德两罚全中又跳投得手，太阳开局10-8领先。布克和布里奇斯连续取分，恩比德连投带罚取下4分，随后他送上暴扣，费城17-16反超比分。麦基勾手命中，布里奇斯两罚全中，小佩顿突破打成，格林送上三分，布里奇斯起飞空接暴扣，尼昂抛投得手，随后约翰逊送上三分，赛布尔回敬压哨三分，费城25-29落后进入次节。</p>
						`
					},
					{
						id: 3,
						url: '/static/pic3.png',
						title: '灰熊时隔18年横扫快船！莫兰特30+7+5遭拉拽',
						msg: `
							<p>北京时间2月9日，NBA常规赛灰熊主场对决快船，灰熊在莫兰特引领下上半场领先15分，前三节莫兰特已经轰下30分，引领灰熊三节取得30分优势奠定胜局，最终灰熊135-109赛季四杀快船收获3连胜，时隔18年再度横扫快船，快船遭遇2连败被湖人反超跌至西部第9名。</p>
							<p>比赛回顾</p>
							<p>本场快船缺少乔治、小卡等4位球员，灰熊缺少狄龙等4位球员。首节威廉姆斯与鲍威尔率先各中一记三分，莫兰特与亚当斯接连得分，鲍威尔再得5分包揽快船前8分。两队继续紧咬比分至12-12，雷吉中投命中，亚当斯连得5分，安德森与莫兰特接连得分取得7分优势。雷吉上篮命中，莫兰特暴扣引领一波8-0取得13分优势，快船回敬一波7-0攻势，安德森2+1命中。科温顿两罚一中，贾伦连得6分，快船再追3分，首节比赛灰熊38-27领先快船。首节灰熊三分10中1，莫兰特9+3+3，快船三分5中2，鲍威尔10分。</p>
						`
					},
					{
						id: 4,
						url: '/static/pic4.jpeg',
						title: '重磅！开拓者双枪正式解体 麦科勒姆被送到鹈鹕联手锡安莺歌',
						msg: `
							<p>北京时间2月9日，NBA常规赛灰熊主场对决快船，灰熊在莫兰特引领下上半场领先15分，前三节莫兰特已经轰下30分，引领灰熊三节取得30分优势奠定胜局，最终灰熊135-109赛季四杀快船收获3连胜，时隔18年再度横扫快船，快船遭遇2连败被湖人反超跌至西部第9名。</p>
							<p>比赛回顾</p>
							<p>本场快船缺少乔治、小卡等4位球员，灰熊缺少狄龙等4位球员。首节威廉姆斯与鲍威尔率先各中一记三分，莫兰特与亚当斯接连得分，鲍威尔再得5分包揽快船前8分。两队继续紧咬比分至12-12，雷吉中投命中，亚当斯连得5分，安德森与莫兰特接连得分取得7分优势。雷吉上篮命中，莫兰特暴扣引领一波8-0取得13分优势，快船回敬一波7-0攻势，安德森2+1命中。科温顿两罚一中，贾伦连得6分，快船再追3分，首节比赛灰熊38-27领先快船。首节灰熊三分10中1，莫兰特9+3+3，快船三分5中2，鲍威尔10分。</p>
						`
					},
					{
						id: 5,
						url: '/static/pic5.png',
						title: '水花兄弟渐入佳境！最强的那支勇士队将要回来了',
						msg: `
							<p>北京时间2月9日，NBA常规赛灰熊主场对决快船，灰熊在莫兰特引领下上半场领先15分，前三节莫兰特已经轰下30分，引领灰熊三节取得30分优势奠定胜局，最终灰熊135-109赛季四杀快船收获3连胜，时隔18年再度横扫快船，快船遭遇2连败被湖人反超跌至西部第9名。</p>
							<p>比赛回顾</p>
							<p>本场快船缺少乔治、小卡等4位球员，灰熊缺少狄龙等4位球员。首节威廉姆斯与鲍威尔率先各中一记三分，莫兰特与亚当斯接连得分，鲍威尔再得5分包揽快船前8分。两队继续紧咬比分至12-12，雷吉中投命中，亚当斯连得5分，安德森与莫兰特接连得分取得7分优势。雷吉上篮命中，莫兰特暴扣引领一波8-0取得13分优势，快船回敬一波7-0攻势，安德森2+1命中。科温顿两罚一中，贾伦连得6分，快船再追3分，首节比赛灰熊38-27领先快船。首节灰熊三分10中1，莫兰特9+3+3，快船三分5中2，鲍威尔10分。</p>
						`
					},
				]
			}
		},
		onLoad() {

		},
		methods: {
			toList() {
				uni.switchTab({
					url: '/pages/list/index'
				});
			}
		}
	}
</script>

<style>
	.one {
		margin: 20rpx;
		display: flex;
		/* flex-direction: column; */
		/* align-items: center; */
		/* justify-content: center; */
	}

	.content {
		display: flex;
		flex-direction: column;
	}

	swiper {
		height: 245px;
	}

	swiper image {
		width: 100%;
	}

	.btn_view {
		margin: 40rpx 20rpx 20rpx;
	}

	.info {
		margin: 30rpx;
		line-height: 2;
	}

	.info view {
		color: #666;
		margin: 20rpx 0;
		text-indent: 2em;
	}



	.list .img {
		width: 60%;
	}

	.list image {
		width: 100%;
		height: 100px;
		overflow: hidden;
		border-radius: 5px;
	}

	.content {
		width: auto;
	}

	.content text {
		color: #666;
		margin: 10rpx;
	}

	.content text:nth-of-type(1) {
		color: #333;
		margin-top: 0;
		line-height: 1.5;
	}

	.title {
		font-size: 36rpx;
		color: #8f8f94;
	}
</style>
